Repository: giellalt/corpus-smj
Catalog: tmx/sma/admin/depts/other_files/laereplan_engelsk.html.tmx
Source language: smj
Languages: sma

source: Udir.no - OAHPPOPLÁDNA – IEŊŊILSGIELLA
sma: LEAROESOEJKESJE EENGELSKEN GÏELESNE

source: Mierreduvvam Máhttodepartementas láhkanjuolgadusá milta 21.06.2013
sma: Vihtiestamme goh mieriedimmie Maahtoedepartemeenteste 21.06.2013.

source: Ulmme
sma: Ulmie

source: Ieŋŋilsgiella le væráltgiella.
sma: Eengelske gïele akte veartenegïele.

source: Gå ietjá almatjij ietjá rijkajs æjvvalip, sijdan jali mannulagán, le miján álu dárbbo ieŋŋilsgiellaj.
sma: Gosse almetjh jeatjah laantijste råaka, gåetesne jallh gosse feeleminie, dle daamtaj eengelskem daarpesjibie.

source: Ieŋŋilsgiella aneduvvá filmajn, girjálasjvuodan, lávllagijn, valástallamijn, oassásijn, buktagijn, diehtagin, ja teknologijan ja daj adnosuorgij baktu le ållo bágo ieŋŋilsgielas boahtám mijá giellaj.
sma: Eengelske åtnasåvva filmesne, lidteratuvresne, laavloemisnie, gaarsjelimmesne, dorjesinie, daejremevoetesne jïh teknologijesne, jïh daejnie åtnoesuerkine jïjnjh eengelsken baakoeh jïh dïejvesh leah geajnoem gaavneme mijjen jïjtsh gïelide.

source: Gå galggap diedojt åhtsåt iehtjama berustimijs jali fágalasj aktijvuodan, de åhtsåp ieŋŋilsgiellaj.
sma: Gosse edtjebe bïevnesh ohtsedidh mijjen jïjtsh ïedtji bïjre jallh faageles ektiedimmesne, dle daamtaj dam eengelsken gïelesne darjobe.

source: Ja ieŋŋilsgiella aneduvvá ienebut åhpadusán gå åvddåla ja aj nubbengiellan moatten vidnudagán.
sma: Lissine eengelske jiene-jienebe ööhpehtimmesne åtnasåvva jïh goh barkoegïele gelline sïeltine.

source: Jus galggap rijbbat væráldin gånnå ieŋŋilsgiella aneduvvá rijkajgasskasasj guládallamin, le dárbulasj adnet ieŋŋilsgielav ja diehtet gåktu giella aneduvvá duon dán aktijvuodan.
sma: Jis edtja bïerkenidh aktene veartenisnie gusnie eengelske åtnasåvva gaskenasjovnaale govlesadtemisnie, dle daerpies dam eengelske gïelem maehtedh, jïh daajroem utnedh guktie gïele åtnasåvva ovmessie sjïekeninie.

source: Dát merkaj åvdedit báhkoboanndudagáv ja tjehpudagáv anátjit giela jiednasystemav, duollatjállemav, grammatihkav ja prinsihpajt gárgadis- ja tækstadahkamij, ja máhttet gielav hiebadit duon dán fáhkaoassáj ja guládallamdilláj.
sma: Daate sæjhta jiehtedh baakoeveahkam evtiedidh jïh tjiehpiesvoeth utnedh gïelen tjoejesysteemem, reaktoetjaelemem jïh grammatihkem nuhtjedh, daajroem utnedh prinsihpi bïjre raajese- jïh tjaalegebigkemasse, jïh maehtedh gïelem ovmessie aamhtesidie jïh govlesadtemetsiehkide sjïehtedidh.

source: Dát sisadná sieradit njálmálasj ja tjálalasj giellaanov ja formálalasj ja iehpeformálalasj giellaanov.
sma: Tjuara aaj maehtedh njaalmeldh jïh tjaaleldh gïeleåtnoen gaskem joekehtidh, jïh byjjes jïh ovbyjjes gïeleåtnoen gaskem.

source: Vijdábut merkaj dat vieledit kultuvralasj sæbrástallamvuogijt ja vættsásvuodakonvensjåvnåjt gå lip gielav adnemin.
sma: Vijriebasse tjuara maehtedh krööhkedh guktie ovmessie kultuvrh ektesne årroeh jïh guktie edtja dåajmijes årrodh viehkine gïeleste.

source: Gielav oahppá gå adná tevstaj valjesvuodav, gånnå tækstamoallánahkko aneduvvá vijdes dádjadusájn.
sma: Gïelem leara gosse gelliesåarhts tjaalegh dååste, gusnie tjaalegedïejvese aktene vijries goerkesisnie åtnasåvva.

source: Dási gulluji njálmálasj ja tjálalasj åvddånbuktema moatten kombinasjåvnån, ja moatte njálmálasj ja tjálalasj tevsta digitála mediájs.
sma: Daate feerhmie dovne njaalmeldh jïh tjaaleldh åehpiedehtemh ovmessie aktanimmine, jïh ovmessie njaalmeldh jïh tjaaleldh tjaalegh digitaale meedijijstie.

source: Gå lip diedulattja strategijajda ma aneduvvi gå gielajt oahppap, ja strategijajt ma viehkedi mijáv dádjadittjat ja dádjaduvátjit, de åmastip máhtov ja tjehpudagáv álkkebut ja buorebut.
sma: Gosse daajroem utnebe dej strategiji bïjre mah åtnasuvvieh gosse gïelh leara, jïh dej strategiji bïjre mah mijjem viehkiehtieh guarkedh jïh guarkeme sjïdtedh, dle aelhkebe sjædta jïh stuerebe mïelem vadta daajroeh jïh tjiehpiesvoeth vejtiestidh.

source: Ájnas le aj biedjat allasis ulmijlt gåktu gielav oahppat, ja gávnnat gåktu ulmijda jåksåt ja árvustallat ietjas giellaanov.
sma: Aaj vihkeles jïjtse ulmieh lïerehtæmman bïejedh, jïh gaavnehtidh guktie maahta ulmide jaksedh jïh jïjtse gïeleåtnoem vuarjasjidh.

source: Ieŋŋilsgielav oahppat doalvvu moattegielakvuohtaj mij máhttá sjaddat oassen ietjama persåvnålasj åvddånimes.
sma: Gosse eengelskem leara dle jienebegïelevoetem sjugnede, jïh dïhte maahta akte vihkeles bielie sjïdtedh mijjen jïjtse evtiedimmeste.

source: Duodden giella oahppamij galggá ieŋŋilsgiella vaddet dádjadusáv viessomvuohkáj ja kultuvrajda gånnå ieŋŋilsgiella le oajvvegiellan jali almulasj giellan.
sma: Lissine gïelelïerehtæmman dle eengelskefaage edtja viehkiehtidh daajroem vedtedh jieledevuekiej jïh kultuvri bïjre gusnie eengelske lea åejviegïele jallh byögkeles gïele.

source: Fága baktu galggap dádjadit gåktu ieŋŋilsgiella aneduvvá rijkajgasskasasj guládallamgiellan.
sma: Faage edtja daajroem vedtedh guktie eengelske åtnasåvva goh akte gaskenasjovnaale govlesadtemevierhtie.

source: Oahppat ieŋŋilsgielak rijkaj birra ja ieŋŋilsgiela ano birra moatten rijkajgasskasasj kontevstajn, vaddá midjij máhttelisvuodav dádjadit væráldav mij mijáv birástahttá ja ieŋŋilsgiela åvddånimev værálda giellan.
sma: Eengelskegïelen laanti bïjre lïeredh, jïh dan ahkedh stuerebe åtnoen bïjre eengelske gïeleste gaskenasjovnaale ektiedimmine, sæjhta akte hijven våarome årrodh veartenen mijjen bïjre guarkedh, jïh evtiedimmien bïjre eengelske gïeleste goh akte veartenegïele.

source: Ieŋŋilsgielak girjálasj tevsta máhtti vaddet låhkåmávov ja tjiegŋalap dádjadusáv iehtjádijs ja ietjastimme.
sma: Eengelskegïelen lidteræære tjaalegh maehtieh lohkeme-aavoem vedtedh mij abpe jieledem ryöhkoe, jïh mubpide jïh jïjtjemem buerebelaakan guarkedh.

source: Njalmálasj, tjálalasj ja digitála tevsta, musihkka ja ietjá kultuvrraåvddånbuktema máhttá arvusmahttet ietjas gisjugisvuodav ja sjuggelisvuodav.
sma: Njaalmeldh, tjaaleldh jïh digitaale tjaalegh, filmh, musihke jïh jeatjah kultuvrevuekieh maehtieh aaj mijjen jïjtse skaepiedihksvoetem skreejrehtidh.

source: Ieŋŋilsgiela fáhka le sihki adnofáhka ja dannelsesfag.
sma: Eengelskefaage lea dovne akte dïrregefaage jïh skearkagimmiefaage.

source: Dajna vatteduvvá máhttelisvuodav oassálasstet guládallamij persåvnålasj, sosiála, girjálasj ja fágalasj suorgijda.
sma: Faage edtja nuepiem vedtedh meatan årrodh soptsestidh jïjtse, sosijaale, lidteræære jïh faageles teemaj bïjre.

source: Fága baktu oadtju dábálasj giellamáhtudagáv gå gulldal, ságas, låhkå ja tjállá, ja oadtju máhttelisvuodav åmastittjat diedojt ja fáhkamáhtov ieŋŋilsgiela baktu.
sma: Faage edtja dam sïejhme gïelemaahtoem bæjjese bigkedh viehkine goltelidh, soptsestidh, lohkedh jïh tjaeledh, jïh nuepiem vedtedh bïevnesh jïh faagedaajroem vejtiestidh dan eengelske gïelen tjïrrh.

source: Åvddånibme kommunikatijva ja gielalasj tjehpudagáj ja kultuvralasj dádjadus máhttá åvdedit buorep aktan doajmmamav, dádjadusáv ja vieledusáv ulmutjij gaskan duot dát kultuvra duogátjis.
sma: Evtiedimmie kommunikatijve jïh gïelen tjiehpiesvoetijste jïh kultuvrelle goerkesistie maahta lissiehtamme laavenjostoem, goerkesem jïh seahkarimmiem skreejredh almetji gaskem ovmessie kultuvremaadtojne.

source: Nav sjaddá giella- ja kultuvramáhtudahka oassen gájkkásasj dannelsen ja le siegen nannimin demokráhtalasj berustimev ja guojmmeviesátvuodav.
sma: Naemhtie gïele– jïh kultuvremaahtoe akte bielie sjædta dehtie sïejhme skearkagimmeste, jïh dam demokrateles eadtjohkevoetem jïh baalteårrojevoetem nænnoestahta.

source: Fága oajvveoase
sma: Faagen åejvieboelhkh

source: Fáhka le juogeduvvam oajvveåsijda, ja juohkka oasen li máhtudakmihto.
sma: Faage lea öörnedamme åejviesuerkine mej sisnie maahtoeulmieh leah hammoedamme.

source: Oajvveoase li oase ållesvuodas ja dajn le aktijvuohta.
sma: Åejviesuerkieh sinsitniem lissiehtieh jïh tjuerieh ektesne vuajnalgidh.

source: Fáhka le aktisasjfáhka mij gullu divna joarkkaåhpadusáj åhpadusprográmmajda.
sma: Faage akte ektiefaage gaajhkide ööhpehtimmieprogrammide jåarhkeööhpehtimmesne.

source: Danen galggá åhpadusáv iesjgeŋga åhpadusprográmmaj hiebadit váj sjaddá nav relevánnta gå vejulasj oahppijda.
sma: Edtja dan åvteste lïerehtimmiem darjodh dan sjyöhtehke goh gåarede viehkine lïerehtimmiem sjïehtedidh dejtie ovmessie ööhpehtimmieprogrammide.

source: Ieŋŋilsfágan li vissa máhtudakmihto vuodoskåvlå 2., 4., 7. ja 10. jahkedáse maŋŋela ja joarkkaåhpadusá Jo1 oahppogárvediddje åhpadusprográmma / Jo2 viddnofágalasj åhpadusprográmma.
sma: Eengelsken gïele maahtoeulmieh åtna 2., 4., 7. jïh 10. jaepiedaltesen mænngan maadthskuvlesne, jïh Jåa1 studijeryöjreden ööhpehtimmieprogrammen / Jåa2 barkoefaageles ööhpehtimmieprogrammen mænngan.

source: Oajvveåsij gåvvå:
sma: Bijjieguvvie åejviesuerkijste:

source: Jahkedásse
sma: Jaepiedaltese

source: Oajvveoase
sma: Åejviesuerkieh

source: Jo1
sma: (barkoefaageles

source: (viddnofágalasj oahppo-prográmma)
sma: ööhpehtimmieprogrammh

source: Giellaåhpadus
sma: Gïelelïerehtimmie

source: Njálmálasj guládallam
sma: Njaalmeldh govlesadteme

source: Tjálalasj guládallam
sma: Tjaaleldh govlesadteme

source: Kultuvrra, sebrudahka ja girjálasjvuohta
sma: Kultuvre, siebriedahke jïh lidteratuvre

source: Giellaåhpadusá oajvveoasen le gatjálvis oahppát ådå gielav, oahppat ieŋŋilsgielav, ja vuojnnet aktijvuodav ieŋŋilsgiela ja iednegiela ja ietjá gielaj gaskan.
sma: Åejviesuerkie gïelelïerehtimmie lea mij lea aktem orre gïelem lïeredh, dam eengelske gïelem lïeredh, jïh ektiedimmieh vuejnedh eengelsken, ietniengïelen jïh jeatjah gïeli gaskem.

source: Dasi gulli máhtto giela hárráj ja dádjadus ietjas giellaåhpadusá hárráj.
sma: Dïhte lea aaj daajroe gïelen bïjre, jïh goerkesem utnedh sov jïjtse gïelelïerehtimmien bïjre.

source: Máhttet ietjas giellaanov árvustallat ja ietjas åhpadusdárbojt ja válljit hiebalgis strategijajt ja barggovuogijt le dárbulasj gå le oahppamin ja adnemin ieŋŋilsgielav.
sma: Maehtedh jïjtse gïeleåtnoem jïh jïjtse lïerehtimmiedaerpiesvoeth vuarjasjidh, jïh sjiehteles strategijh jïh barkoevuekieh veeljedh lea nuhteligs jis edtja dam eengelske gïelem lïeredh jïh nuhtjedh.

source: Njálmálasj guládallama oajvveoasen le gatjálvis dádjadit ja adnet ieŋŋilsgielav gå gulldala, håla ja ságastalá ja gå aná hiebalgis guládallamstrategijajt.
sma: Åejviesuerkie njaalmeldh govlesadteme lea maehtedh guarkedh jïh nuhtjedh dam eengelske gïelem viehkine goltelidh, soptsestidh jïh maereles govlesadtemestrategijh nuhtjedh.

source: Oajvveoasen le gatjálvis åvdedit báhkoboanndudagáv ja adnet idiomáhtalasj struktuvrajt ja grammahtalasj skåvijt håladattijn ja ságastaládijn.
sma: Åejviesuerkie sæjhta jiehtedh baakoeveahkam evtiedidh, jïh idiomatihkeles struktuvrh jïh grammatihkeles hammoeh nuhtjedh gosse mubpide jïh mubpiejgujmie soptseste.

source: Dasi gullu aj ságastit tjielgga jiednadimijn ja intonasjåvnåjn.
sma: Edtja aaj maehtedh gïelem tjïelkelaakan soptsestidh jïh intonasjovnine.

source: Oajvveoasen le gatjálvis gulldalit, dádjadit ja adnet ieŋŋilsgielav moatten guládallam aktijvuodan.
sma: Åejviesuerkie sæjhta jiehtedh goltelidh, guarkedh jïh dam eengelske gïelem nuhtjedh ovmessie njaalmeldh govlesadtemetsiehkine.

source: Ájnas le vuosedit berustimes ja vieledimev dábálasj sæbrástallamvuogijda.
sma: Dåajmijesvoetem vuesiehtidh jïh krööhkedh dejtie sïejhme vuekide guktie ektesne årrobe lea akte vihkeles bielie.

source: Dánna le aj gatjálvis gielav hiebadit ulmmáj ja vuosstájválldijda, duola dagu sieradit formalalasj ja iehpeformalalasj njálmálasj giellaanov.
sma: Edtja aaj maehtedh gïelem åssjelasse jïh dåastoejasse sjïehtedidh, gaskem jeatjah byjjes jïh ovbyjjes njaalmeldh gïeli gaskem joekehtidh.

source: Adnet duov dáv mediav ja ressursav, ja gielalasj boanndudagáv åvdedit fágaj ja fáhkaåsij gaskav le guovdátjin dán oajvveoasen.
sma: Åtnoe ovmessie meedijijstie jïh vierhtijste, jïh evtiedimmie aktede gïelevåarhkoste faagi jïh aamhti dåaresth leah vihkeles daennie åejviesuerkesne.

source: Tjálalasj guládallama oajvveoasen le gatjálvis dádjadit ja adnet ieŋŋilsgielav gå le låhkåmin ja tjállemin ja adnet hiebalgis låhkåm- ja tjállemstretegijajt.
sma: Åejviesuerkie tjaaleldh govlesadteme lea maehtedh guarkedh jïh nuhtjedh dam eengelske gïelem viehkine lohkedh jïh tjaeledh, jïh maereles lohkeme- jïh tjaelemestrategijh nuhtjedh.

source: Oajvveoasen le gatjálvis låhkåt duov dáv tevstav ieŋŋilsgiellaj arvusmahtátjit låhkåmávov ja muossádimijt, ja dádjadittjat ja åmastittjat máhtov.
sma: Åejviesuerkie lea maehtedh lohkedh jeereldihkie tjaalegh eengelsken gïelesne juktie lohkeme-aavose jïh dååjresasse skreejredh, jïh guarkedh jïh daajroem vejtiestidh.

source: Dási gullu ållo låhkåm mij åvdet gielladádjadusáv ja tækstamáhtudagáv.
sma: Dellie tjuara jïjnjem lohkedh juktie gïelegoerkesem jïh tjaalegemaahtoem evtiedidh.

source: Låhkåt moattelágásj tevstajt le buorre persåvnålasj åvddånibmáj, láddamij ja kreativitehttaj ja båktå mielav tevstajt dahkat.
sma: Ovmessie såarhts tjaalegh lohkedh maahta våaromem bïejedh persovneles sjïdtedæmman, skearkagæmman jïh skaepiedihksvoetese, jïh skraejriem vedtedh jïjtse tjaalegh darjodh.

source: Oajvveoasen le aj gatjálvis tevstajt tjállet ieŋŋilsgiellaj duon dán guládallam aktijvuodan mij arvusmahttá tjállemávov ja muossádimijt, ja dádjadittjat ja åmastittjat máhtov.
sma: Åejviesuerkie aaj feerhmie eengelsken tjaalegh tjaeledh ovmessie govlesadtemetsiehkine juktie tjaeleme-aavose jïh dååjresasse skreejredh, jïh guarkedh jïh daajroem vejtiestidh.

source: Dánna le aj gatjálvis hiebadit gielav ulmmáj ja vuosstájválldijda, duola dagu sieradit formalalasj ja iehpeformalalasaj tjálalasj giellaanov.
sma: Edtja aaj maehtedh gïelem åssjelasse jïh dåastoejasse sjïehtedidh, gaskem jeatjah byjjes jïh ovbyjjes tjaaleldh gïeli gaskem joekehtidh.

source: Oajvveoasen le gatjálvis åvdedit báhkoboanndudagáv ja adnet duollatjállemav, idiomáhtalasj struktuvrajt ja grammahtalasj skåvijt tjáledijn.
sma: Åejviesuerkesne edtja aaj baakoeveahkam evtiedidh jïh reaktoetjaelemem, idiomatihkeles struktuvrh jïh grammatihkeles hammoeh tjaalegisnie nuhtjedh.

source: Dási gullu aj dahkat struktuvrajt ja aktijvuodajt tevstajn.
sma: Edtja aaj struktuvrem jïh ektiedimmiem tjaaleginie sjugniedidh.

source: Oajvveoasen Kultuvrra, sebrudahka ja girjálasjvuohta le gatjálvis kultuvrradádjadusás vijdes sisanujn.
sma: Åejviesuerkie kultuvre, siebriedahke jïh lidteratuvre leah kultuvregoerkese aktene vijries goerkesisnie.

source: Álggo le ieŋŋilsgielak rijka, ja guosská guovdásj åsijda sebrudakiellemin, girjálasjvuodan ja ja ietjá kultuvrraåvddånbuktemijn.
sma: Dïhte våarome lea eengelskegïelen laanth, jïh vihkeles aamhtesh feerhmie mah leah siebriedahkejieleden, lidteratuvren jïh jeatjah kultuvrevuekiej bïjre.

source: Oajvveoasen le aj gatjálvis máhtov åmastit ieŋŋelskgiela hárráj værálda giellan måttijn adnovejulasjvuodaj.
sma: Åejviesuerkesne edtja aaj maehtedh daajroem vejtiestidh eengelsken gïelen bïjre goh akte veartenegïele jïjnjh åtnoesuerkiejgujmie.

source: Oajvveoasen le gatjálvis árvvaladfat ja barggat fáhkatevstaj, girjálasj tevstaj ja kultuvralasj åvddånbuktemij duot dát medias.
sma: Åejviesuerkesne edtja barkedh faagetjaalegigujmie, lidteræære tjaalegigujmie jïh kultuvrelle lahtestimmiehammoejgujmie ovmessie kultuvrijste, jïh dejtie digkiedidh.

source: Dát le ájnas máhtov ja dádjadusáv åvddånahtátjit ja aj vieledusáv iehtjádij viessomvuogijs ja kultuvrajs.
sma: Daate lea vihkeles juktie daajroem, goerkesem jïh seahkarimmiem evtiedidh mubpiej jieledevuekide jïh kultuvride.

source: Tijmmalåhko
sma: Man gellie tæjmoeh

source: Akta tijmma le 60-minuhta.
sma: Tæjmoeh leah 60-minudten ektievoetine:

source: 1.-4. jahkedásen: 138 tijma
sma: 1.–4. jaepiedaltese: 138 tæjmoeh

source: 5.-7. Jahkedásen: 228 tijma
sma: 5.–7. jaepiedaltese: 228 tæjmoeh

source: 8.-10 jahkedásen: 222 tijma
sma: 8.–10. jaepiedaltese: 222 tæjmoeh

source: OAHPPOGÁRVEDIME ÅHPADUSPROGRÁMMA
sma: STUDIJERYÖJREDEN ÖÖHPEHTIMMIEPROGRAMMH

source: Jo1: 140 tijma
sma: Jåa1: 140 tæjmoeh

source: Jo1: 84 tijma
sma: Jåa1: 84 tæjmoeh

source: Jo 2: 56 tijma
sma: Jåa2: 56 tæjmoeh

source: Vuodotjehpudagá
sma: Faagen maadth maahtoeh

source: Vuodotjehpudagá li avtajduhtedum máhtudakmihtojda gånnå åvdedi fáhkamáhtudagáv ja li oassen fáhkamáhtudagás.
sma: Vihkeles tjiehpiesvoeth lea meatan vaaltasovveme maahtoeulmine gusnie dah viehkiehtieh evtiedimmine jïh lea akte bielie faagemaahtoste.

source: Ieŋŋiskgielan dádjaduvvi vuodotjehpudagá náv:
sma: Eengelsken gïelesne guarka dejtie vihkeles tjiehpiesvoetide naemhtie:

source: Njálmálasj tjehpudagá ieŋŋilsgielan li gulldalit, hållat ja aktan doajmmat ieŋŋilsgiela baktu.
sma: Njaalmeldh tjiehpiesvoeth eengelsken gïelesne lea maehtedh goltelidh, håaledh jïh govlesadtedh viehkine dam eengelske gïelem nuhtjedh.

source: Dát merkaj árvustallat ja hiebadit åvddånbuktemijt ulmmáj, vuosstájválldijda ja dilláj, ja aj oahppat sosiála konvensjåvnåj ja sæbrástallamvuogij birra ieŋŋelskgielak rijkajn ja rijkajgasskasasj kontevstajn.
sma: Edtja aaj vuarjasjidh jïh sjïehtedidh soptsestimmievuekieh åssjelasse, dåastoejasse jïh tseahkan.

source: Njálmálasj tjehpudagá åvddånibme ieŋŋilsgielan merkaj adnet njálmálasj gielav dárkkelappot ja moatte láhkáj ságastaládijn ja ietjá njálmálasj guládallamin.
sma: Edtja aaj sosijaale konvensjovni bïjre lïeredh jïh guktie almetjh sinsætnan dåemiedieh dejnie laantine gusnie eengelske gïele åtnasåvva jïh gaskenasjovnaale ektiedimmine.

source: Vijdábut merkaj gulldalit, dádjadit ja ságastallat duov dáv ássjev ja tjuolmaj birra ja daj baktu åmastit fáhkamáhtov.
sma: Edtja aaj goltelidh, guarkedh jïh digkiedidh ovmessie aamhtesh jïh dåeriesmoeretjoelmh juktie faagedaajroem vejtiestidh.

source: Dát merkaj aj dádjadit variántajt njálmálasj ieŋŋilsgielas duot dát guovlos væráldin.
sma: Edtja aaj maehtedh joekehts såarhts eengelske gïelem guarkedh ovmessie bielijste veartenisnie.

source: Buktet tjállet ieŋŋiskgiela hárráj le máhttet buktet åvddån ájádusájt ja vuojnojt tjálalattjat dádjadahtte ja hiebalgis láhkáj.
sma: Maehtedh tjaeledh eengelsken gïelesne lea maehtedh åssjaldahkh jïh mïelh buektedh maereleslaakan jïh naemhtie guktie mubpieh guarkah viehkine dehtie eengelske tjaelemegïeleste.

source: Dát merkaj plánit, hábbmit ja ásadit tevstajt majna guládallá, ja gånnå le buorre struktuvrra ja aktijvuohta.
sma: Dellie tjuara soejkesjidh, hammoedidh jïh gïetedidh tjaalegh mah govlesedtieh, jïh mah hijven struktuvrem jïh ektiedimmiem utnieh.

source: Duodden le tjállem ájnas ja oassen giellaoahppamis.
sma: Lissine dle tjaeleme akte dïrrege gïelelïerehtimmien gaavhtan.

source: Åvddånit tjállemtjehpudagá hárráj ieŋŋilsgielan merkaj oahppat duollatjállemav, ja báhkoboanndudagáv ja gielalasj struktuvrajt åvddånahttet.
sma: Evtiedimmie tjaelemetjiehpiesvoetijste eengelsken gïelesne lea lïeredh staaran tjaeledh jïh aktem stuerebe stuerebe baakoeveahkam eengelske baakojste jïh gïelestruktuvrijste evtiedidh.

source: Vijdábut åvddånahttet máhtudagáv tjálátjit duov dáv dábálasj, girjálasj ja fágalasj tevstajt ieŋŋelsk giellaj iehpeformálalasj ja formálalasj giellaanujn, hiebadum ulmmáj ja vuosstáválldijda.
sma: Edtja aaj aktem gellielaaketje maahtoem evtiedidh ovmessie såarhts sïejhme, lidteræære jïh faageles tjaalegh eengelsken gïelesne tjaeledh, aktine ovbyjjes jïh byjjes gïeline mij lea åssjelasse jïh dåastoejasse sjïehtedamme.

source: Buktet låhkåt ieŋŋliskgielan le oadtjot dádjadusáv duot dát tevstas.
sma: Maehtedh lohkedh faagesne eengelske lea maehtedh mïelem sjugniedidh ovmessie såarhts tjaalegijstie.

source: Dát merkaj ieŋŋiskgielak tevstajt låhkåt vaj dádjat, reflekteri ja åmas dádjadusáv ja máhtov kultuvrajs ja fáhkasuorgijs.
sma: Dellie edtja eengelskegïelen tjaalegh lohkedh juktie guarkedh, ussjedidh jïh goerkesem jïh daajroem vejtiestidh kultuvri jïh faagesuerkiej dåaresth.

source: Dát merkaj aj gárvedit, dahkat ja hárjjánit låhkåt ieŋŋilsgielak tevstajt duon dán sivá diehti, ja duot dát guhkkudagás ja gássjelisvuodas.
sma: Edtja aaj soejkesjidh, lohkedh jïh lohkemem gïetedidh eengelskegïelen tjaalegijstie ovmessie åssjelidie, jeereldihkie gåhkojne jïh gïervevoetine.

source: Åvddånit låhkåmtjehpudagá hárráj ieŋŋilsgielan le adnuj válldet låhkåmstrategijajt hiebadum låhkåma ulmmáj maŋenagi gássjelap tevstaj.
sma: Evtiedimmie lohkemetjiehpiesvoetijste eengelsken gïelesne lea maehtedh åtnose vaeltedh lohkemevuekieh mah leah sjïehtedamme åssjelasse lohkeminie, ahkedh vielie krïevije tjaalegisnie.

source: Vijdábut le gatjálvis låhkåt ieŋŋliskgielak tevstajt duolla ja dádjadusájn, ja guoradallat, árvvaladdat, oahppat ja ájádallat duov dáv diedov.
sma: Edtja aaj eengelskegïelen tjaalegh iktemearan jïh goerkesinie lohkedh, jïh goerehtidh, digkiedidh, lïeredh jïh ussjedidh ovmessie såarhts bïevnesi bïjre.

source: Buktet rieknit ieŋŋliskgielan le oadtjot adnet guoskavasj matematihkalasj buojkuldagájt ieŋŋliskgiellaj duon dán dilen.
sma: Maehtedh ryöknedh eenglesken gïelesne lea maehtedh sjyöhtehke matematihkeles dïejvesh eengelsken gïelesne nuhtjedh ovmessie tsiehkine.

source: Dát merkaj dåbddåt mihttimavtadagájt ma ieŋŋliskgielak rijkajn aneduvvi, ja dádjadit ja guládallat tállaj, grafalasj åvddånbuktemij, tabellaj ja statestihkaj ieŋŋliskgiellaj.
sma: Edtja möölegeektievoeth damtedh mah åtnasuvvieh eengelskegïelen laantine, jïh guarkedh jïh govlesadtedh taali bïjre, grafihkeles åehpiedehtemh, tabellh jïh statistihkh eengelsken gïelesne.

source: Rieknimtjehpudagá åvddånibme ieŋŋliskgiela hárráj merkaj adnet tállajt ja rieknimav gå åvddånahttá repertoarav matematihka termajs ieŋŋliskgiellaj ma li viettjadum bæjválasj iellemis, ja dábálasj ja fágalasj ássjijs.
sma: Evtiedimmie ryöknemetjiehpiesvoetijste eengelsken gïelesne sæjhta jiehtedh taalh jïh ryöknemem nuhtjedh viehkine våarhkoem evtiedidh matematihkeles teermijste eengelsken gïelesne mah leah aarkebeajjan ektiedamme, jïh sïejhme jïh faageles teermh.

source: Digitála tjehpudagá ieŋŋilsgielan le máhttet adnet valjep oasev digitála vædtsagijs, miediajs ja ressursajs nannitjit giellaoahppamav, guládalátjit ieŋŋilsgiellaj ja åmastittjat guoskavasj máhtov ieŋŋilsfágan.
sma: Digitaale tjiehpiesvoeth eengelsken gïelesne lea maehtedh aktem jeereldihkie veahkam digitaale dïrregijstie, meedijijstie jïh vierhtijste nuhtjedh juktie gïelelïerehtimmiem nænnoestehtedh, eengelsken gïelesne govlesadtedh jïh sjyöhtehke daajroem vejtiestidh eengeleskefaagesne.

source: Gå adná digitála ressursajt de vaddá dat máhttelisvuodajt åtsådalátjit ieŋŋilsgielak tevstajt autentalasj dilijn, dat sihtá javllat luondulasj, ij-hiebadum dilijn.
sma: Åtnoe digitaale vierhtijste nuepiem vadta eengelskegïelen tjaalegh dååjredh rïektes tsiehkine, amma iemie, ij-sjïehtedamme tsiehkieh.

source: Åvddånahttet digitála tjehpudagájt merkaj viedtjat ja giehtadallat diedojt majs ådå tevstajt vas dahká.
sma: Evtiedimmie digitaale tjiehpiesvoetijste sæjhta jiehtedh bïevnesh ribledh jïh gïetedidh juktie ovmessie såarhts tjaalegh sjugniedidh.

source: Digitála hábmegájbbádus tevstajn merkaj jut effekta, gåvå, tabella, bajelttjállaga ja tsiehke li tjoahkkáj biejaduvvam nannitjit ja gaskostittjat diedojt.
sma: Digitaale hammoekrïevenassh tjaaleginie sæjhta jiehtedh effekth, guvvieh, tabellh, bijjietjaalegh jïh mearhketjh leah tjåanghkan bïejeme juktie aktem dïjrem tjïertestidh jïh leerehtidh.

source: Dánne le aj gatjálvis adnet digitála gáldojt tjálalasj ja njálmálasj tevstajn, ja adnet lájttalis ja iesjrádálasj guottov gálldoadnuj.
sma: Edtja aaj maehtedh digitaale gaaltijh nuhtjedh tjaaleldh jïh njaalmeldh tjaaleginie, jïh laejhtehks jïh jïjtjeraarehke årrodh gaaltijeåtnose.
